tutorials/Couette/Eccentric/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     suspensionBalanceFoam;

startFrom       latestTime;

startTime       0;

stopAt          writeNow;//endTime;

endTime         30000;

deltaT          0.025;

writeControl    adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;
 

functions
{
    horizontalLine
    {
        start   (0.0064 0 5e-04);
        end     (0.0238 0 5e-04);
        fields  (c p gamma U);

        #includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

        setConfig
        {
            axis    x;
            nPoints 100;
        }

        // Must be last entry
        #includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
    }
}


// ************************************************************************* //
